Autodesk.Navisworks.Api.ClipPlaneSet
Represents the set of clip planes in a view.

Autodesk.Navisworks.Api.ClipPlaneSet.#ctor


Autodesk.Navisworks.Api.ClipPlaneSet.Box
The clipping box position.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.BoxTransform
The internal transform used for the section box.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.Clips(Autodesk.Navisworks.Api.Point3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.CopyFrom(Autodesk.Navisworks.Api.ClipPlaneSet)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.CurrentPlane
The current clip plane.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.CurrentPlaneIndex
The index of the current plane.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlaneSet.Enabled
Is the clipping set enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlaneSet.FitToBox(Autodesk.Navisworks.Api.BoundingBox3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'boundingBox' is null
Throws System.ArgumentException:
Argument 'boundingBox' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.Get(System.Int32)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.GetOrientedBox(Autodesk.Navisworks.Api.BoundingBox3D,Autodesk.Navisworks.Api.Rotation3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentException:
Argument 'box' has been Disposed
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.GetTransform(System.Int32)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.IsOffsetPlanes(Autodesk.Navisworks.Api.ClipPlaneSet)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.ClipPlaneSet.Linked
Are the clip planes linked.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlaneSet.Mode
The mode of the set.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ClipPlaneSet.Range
The range over which the clip planes operate.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'range' is null
Throws System.ArgumentException:
Argument 'range' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.SetOrientedBox(Autodesk.Navisworks.Api.BoundingBox3D,Autodesk.Navisworks.Api.Rotation3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.SetTransform(System.Int32,Autodesk.Navisworks.Api.Transform3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'trans' is null
Throws System.ArgumentException:
Argument 'trans' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.Size
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.Transform(Autodesk.Navisworks.Api.Transform3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'trans' is null
Throws System.ArgumentException:
Argument 'trans' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.Translate(System.Int32,Autodesk.Navisworks.Api.Vector3D)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'offset' is null
Throws System.ArgumentException:
Argument 'offset' has been Disposed

Autodesk.Navisworks.Api.ClipPlaneSet.ValueEquals(Autodesk.Navisworks.Api.ClipPlaneSet)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.ClipPlaneSet.ValueEquals(Autodesk.Navisworks.Api.ClipPlaneSet,Autodesk.Navisworks.Api.ClipPlaneSet)
Compares the two references 'By Value'